[
    {
        "id": 3,
        "slug": "uni-vs-hochschule-informatik",
        "title": "Uni vs. Hochschule – Was passt besser für ein Informatikstudium?",
        "desc": "Ein Vergleich zwischen Universität und Hochschule im Informatikstudium – mit einem persönlichen Einblick in die Wahl eines dualen Studiums.",
        "date": "03.06.2025",
        "image": "blog-unihochschule.webp",
        "content": "<p><strong>Die Entscheidung zwischen Universität und Hochschule spielt im Informatikstudium eine zentrale Rolle.</strong></p><br><p>Beide Institutionstypen verfolgen unterschiedliche Ansätze in der Lehre. Während Universitäten einen stark wissenschaftlich-theoretischen Fokus bieten, sind Hochschulen stärker praxisorientiert. Dieser Beitrag beleuchtet die strukturellen Unterschiede und vergleicht beispielhaft die Technische Universität München (TUM) mit der Hochschule München.</p><br><h2>1. Universität – Fokus auf Theorie und Forschung</h2><p>Universitäten sind traditionell auf Forschung und wissenschaftliche Methodik ausgerichtet. Im Informatikstudium liegt der Schwerpunkt häufig auf abstrakten Konzepten, mathematischen Grundlagen und theoretischer Informatik. Die Studieninhalte sind in der Regel stark formalisiert und legen Wert auf analytisches Denken sowie wissenschaftliches Arbeiten.</p><br><h2>2. Hochschule – Praxisorientierte Lehre</h2><p>Hochschulen (ehemals Fachhochschulen) legen ihren Fokus auf die Anwendung der Informatik im beruflichen Kontext. Die Studiengänge sind stärker an praktischen Projekten, Fallbeispielen und industriellen Anforderungen ausgerichtet. Typisch sind kleinere Gruppen, intensivere Betreuung und oft auch feste Praxisphasen im Studienverlauf.</p><br><h2>3. Vergleich: TUM vs. Hochschule München</h2><p><strong>Technische Universität München (TUM):</strong> International renommierte Forschungseinrichtung mit einem breiten Spektrum an Spezialisierungsmöglichkeiten und einem stark forschungsorientierten Curriculum.</p><p><strong>Hochschule München:</strong> Praxisnahe Ausbildung mit konkretem Anwendungsbezug, enger Zusammenarbeit mit Unternehmen und Projektarbeit als fester Bestandteil des Studiums.</p><br><h2>4. Persönliche Perspektive: Warum ein duales Studium an der Hochschule gewählt wurde</h2><p>Die Wahl fiel bewusst auf ein duales Informatikstudium an einer Hochschule. Entscheidende Gründe waren der hohe Praxisanteil und die Möglichkeit, theoretisches Wissen direkt anzuwenden. Besonders im Bereich Informatik erweist sich die praktische Anwendung als essenziell, um Konzepte wirklich zu verstehen und dauerhaft zu verinnerlichen.</p><br><p>Praxis bedeutet in diesem Zusammenhang nicht nur das Absolvieren verpflichtender Praktika, sondern vor allem eigenständige Projektarbeit – auch außerhalb des Curriculums. Durch die Verbindung von Theorie und aktiver Anwendung ergibt sich ein tieferes Verständnis, das über bloßes Auswendiglernen hinausgeht. Die Leidenschaft für das Fach und die Motivation, selbstständig an Softwareprojekten zu arbeiten, spielen dabei eine entscheidende Rolle.</p><br><h2>5. Fazit</h2><p>Universität und Hochschule bieten jeweils unterschiedliche Schwerpunkte und Zugänge zum Informatikstudium. Die Wahl sollte auf Grundlage individueller Lernpräferenzen, Zielvorstellungen und Interessen erfolgen. Während die Universität eine fundierte wissenschaftliche Ausbildung ermöglicht, bietet die Hochschule eine anwendungsnahe und praxisbezogene Studienerfahrung. Beide Wege haben ihre Berechtigung – entscheidend ist, welcher besser zum eigenen Profil passt.</p>"
    },
    {
        "id": 2,
        "slug": "stripe-erfahrung",
        "title": "Meine Erfahrungen mit Stripe als Zahlungsanbieter",
        "desc": "Ein Erfahrungsbericht zur Integration von Stripe und ein Vergleich mit anderen Anbietern wie Frispi (ehemals Billwerk).",
        "date": "06.06.2025",
        "image": "stripe-blog.webp",
        "content": "<p><strong>Stripe ist einer der bekanntesten Anbieter für Online-Zahlungsabwicklungen weltweit.</strong> Besonders im Vergleich zu deutschen Anbietern wie Frispi (ehemals Billwerk) fällt auf, wie umfassend und entwicklerfreundlich Stripe aufgebaut ist.</p><br><p>Ich habe zum ersten Mal mit Stripe gearbeitet, als ich ein Bestellformular für einen Kunden aus dem Cloud-Umfeld – konkret für Nextcloud – entwickelt habe. Davor war ich bereits mit der Zahlungsintegration über Billwerk vertraut. Stripe war für mich Neuland, aber gerade dieser direkte Vergleich hat deutlich gezeigt, warum Stripe als Marktführer gilt.</p><br><p>Was sofort auffällt: Die Fülle an <strong>Produkten, Diensten und Features</strong>, die Stripe anbietet, ist beeindruckend. Nahezu jeder denkbare Use Case im Bereich Payment, Abos, Rechnungsstellung oder Nutzerverifizierung wird abgedeckt. Und das Beste: Für Entwickler ist Stripe nicht nur technisch mächtig, sondern auch angenehm zu nutzen. Die <strong>Dokumentation</strong> ist klar, durchdacht und praxisnah. Selbst komplexe Anforderungen lassen sich schnell umsetzen.</p><br><p>Ein weiteres Plus ist die tiefe Integration in das moderne Entwickler-Ökosystem. Stripe arbeitet z. B. mit <strong>GitHub Copilot</strong> zusammen – was bedeutet, dass man oft schon im Editor relevante Unterstützung bekommt. Und auch der <strong>Support</strong> reagiert schnell und kompetent.</p><br><h2>Was ist Stripe?</h2><p><strong>Stripe ist ein international agierender Zahlungsdienstleister mit Sitz in den USA.</strong> Gegründet im Jahr 2010, hat sich das Unternehmen auf APIs und Infrastruktur zur Zahlungsabwicklung im Internet spezialisiert. Heute wird Stripe von Startups, großen E-Commerce-Plattformen und SaaS-Unternehmen weltweit eingesetzt.</p><br><p>Das Angebot umfasst eine Vielzahl von Services: Einmalzahlungen, Abo-Verwaltung, Rechnungsstellung, Betrugsprävention, Steuerberechnung, Finanzberichte, Connect für Plattformlösungen und mehr. Die Stärke von Stripe liegt in der Kombination aus <strong>technischer Qualität</strong>, <strong>umfangreicher Dokumentation</strong> und einem durchdachten Entwicklererlebnis.</p><br><p>Stripe ist in über 40 Ländern verfügbar und unterstützt zahlreiche Zahlungsmethoden – darunter Kreditkarten, Apple Pay, Google Pay, SEPA, Klarna und viele mehr. Besonders bei international ausgerichteten Projekten bietet Stripe eine starke Grundlage.</p>"
    },
    {
        "id": 1,
        "slug": "hello-world",
        "title": "Mein erster Blog Post",
        "desc": "Ein Einblick in meine Reise als Entwickler und der Start meines Blogs.",
        "date": "4.05.2025",
        "image": "blog-welcome.webp",
        "content": "<p><strong>Willkommen zu meinem ersten Blogeintrag.</strong></p><br><p><strong>Mein Name ist Ben Ho</strong>. Ich bin Entwickler und seit meiner Jugend technikbegeistert. Den Einstieg in die Welt der Softwareentwicklung habe ich mit 16 Jahren über Skriptsprachen bei <strong>FiveM</strong> gefunden. Anschließend verlagerte sich mein Fokus auf die <strong>Frontend-Entwicklung</strong> – insbesondere die Gestaltung und Umsetzung von Benutzeroberflächen in Webprojekten.</p><br><p>Schon früh begann ich, mir eigenständig Wissen im Bereich IT anzueignen. Durch meinen Vater konnte ich zusätzlich einen ersten Einblick in die Welt der Serveradministration gewinnen. Heute liegt mein Schwerpunkt in der praktischen Entwicklung von Anwendungen, bei der ich sowohl technisches Verständnis als auch gestalterisches Denken verbinde.</p><br><p>Dieser Blog dient als persönliche Sammlung meiner Gedanken, Erfahrungen und Meinungen aus der Welt der Softwareentwicklung. Es geht hier nicht um allgemeingültige Wahrheiten, sondern um meine Perspektive auf Technologien, Projektarbeit und Lernprozesse.</p><br><p><strong>Typische Inhalte dieses Blogs:</strong></p><p>- <strong>Einblicke</strong> in Projekte, an denen ich gearbeitet habe<br>- <strong>Subjektive Einschätzungen</strong> zu Tools und Frameworks<br>- <strong>Dokumentation</strong> meines Lernfortschritts<br>- <strong>Gedanken</strong> zu effizienten Arbeitsmethoden</p><br><p>Alle Beiträge spiegeln ausschließlich meine persönlichen Erfahrungen und Sichtweisen wider und sind nicht als fachliche Anleitung zu verstehen. Ziel ist es, Erlebtes festzuhalten und den fachlichen Austausch zu fördern.</p><br><p>Weitere Beiträge folgen.</p>"
    }
]
